'''
Подвиг 7. Вводятся номера телефонов в одну строчку через пробел с разными кодами стран: +7, +6, +2, +4 и т.д.
Необходимо составить словарь d, где ключи - это коды +7, +6, +2 и т.п., а значения - список номеров
(следующих в том же порядке, что и во входной строке) с соответствующими кодами. Полученный словарь вывести командой:

print(*sorted(d.items()))

Sample Input:
+71234567890 +71234567854 +61234576890 +52134567890 +21235777890 +21234567110 +71232267890
Sample Output:
('+2', ['+21235777890', '+21234567110']) ('+5', ['+52134567890']) ('+6', ['+61234576890']) ('+7', ['+71234567890', '+71234567854', '+71232267890'])
'''

lst_all = []
d = input().split()
d.sort(key=lambda x: x[1])

lst_num = [d[0]]
for i in range(1, len(d)):

    if d[i-1][1] == d[i][1]:
        lst_num.append(d[i])
        if i == len(d)-1:
            lst_all.append([d[i][:2], lst_num])
        continue
    else:
        lst_all.append([d[i-1][:2], lst_num])
        lst_num = []
        lst_num.append(d[i])

lst = dict(lst_all)
print(*sorted(lst.items()))