'''
Большой подвиг 6. Вводится список целых чисел в одну строку через пробел.
Необходимо выполнить его сортировку выбором по возрастанию (неубыванию).

Вначале мы рассматриваем первый элемент списка и ищем второй минимальный относительно первого элемента (включая и его).
На рисунке - это последний элемент со значением -1. Затем, меняем местами первый и последний элементы.
Переходим ко второму элементу списка и повторяем эту же процедуру, но относительно второго элемента (то есть, первый уже не рассматриваем).
На рисунке минимальный элемент - это 2, поэтому менять местами здесь ничего не нужно. Переходим к 3-му элементы со значением 6.
Относительно него находим минимальный элемент - это 3. Меняем их местами.

Вот идея алгоритма сортировки выбором. Реализуйте его для вводимого списка целых чисел.
Результат выведите в виде списка чисел одну строку через пробел.

Sample Input:
8 11 -53 2 10 11
Sample Output:
-53 2 8 10 11 11
'''

sps = list(map(int, input().split()))
for i in range(len(sps)-1):
    if sps[i] > min(sps[i:]):
        ind = sps.index(min(sps[i:]), i)
        sps[i], sps[ind] = sps[ind], sps[i]
print(*sps)
